
 {
            "scores": {
                "structure": 40,
                "clarity": 42,
                "tone": 60,
                "engagement": 38,
                "persuasiveness": 42,
                "grammar": 50,
                "overall": 44
            },
            "strengths": [
                "The central theme of perseverance is clear and universally relatable.",
                "Positive, encouraging tone when extended with full content.",
                "Concise premise that can serve as a strong hook if expanded."
            ],
            "weaknesses": [
                "Extremely brief content provides no structure: no opening hook, body, or conclusion.",
                "Lacks concrete examples, data, or anecdotes to support the claim.",
                "No audience-specific relevance or calls to action.",
                "Ellipsis suggests continuation but the current content leaves the idea incomplete.",
                "Minimal opportunities for pacing variation or rhetorical devices."
            ],
            "suggestions": "Develop the speech with a clear structure: opening hook (story or question), 2-3 body points with concrete examples and relatable anecdotes, and a closing call to action. Use varied pacing: slower for key points, faster for momentum; insert short pauses after important statements. Include evidence or relatable examples of perseverance (student challenges, overcoming setbacks). Employ rhetorical devices (anaphora, triads) and direct address to build connection. End with a clear action for students (how they can persevere today). Ensure grammar and syntax are complete sentences, avoid trailing ellipses except for deliberate stylistic choice.",
            "summary": "The speech concept has strong potential but current text is too brief to assess structure, pacing, or persuasiveness. Expanding with concrete examples, audience connection, and a defined opening/body/conclusion will improve clarity, engagement, and overall impact."
        }
